[
  {
    'id': 'in-8dedd024a53c94e2',
    'site': 'indeed',
    'job_url': 'https://www.indeed.com/viewjob?jk=8dedd024a53c94e2',
    'job_url_direct': 'https://careers.google.com/jobs/results/132285773683532486-senior-staff-software-engineer/',
    'title': 'Senior Staff Software Engineer, Google Cloud Applications AI',
    'company': 'Google',
    'location': 'Sunnyvale, CA, US',
    'date_posted': datetime.date(2025,
    9,
    8),
    'job_type': 'fulltime',
    'salary_source': 'direct_data',
    'interval': 'yearly',
    'min_amount': 248000.0,
    'max_amount': 349000.0,
    'currency': 'USD',
    'is_remote': False,
    'job_level': None,
    'job_function': None,
    'listing_type': None,
    'emails': None,
    'description': "### **Minimum qualifications:**\n\n* Bachelor’s degree or equivalent practical experience.\n* 8 years of experience in software development.\n* 7 years of experience leading technical project strategy, Machine Learning (ML) design, and optimizing industry\\-scale ML infrastructure (e.g., model deployment, model evaluation, data processing, debugging, fine tuning).\n* 5 years of experience with design and architecture; and testing/launching software products.\n* 2 years of experience with Generative AI techniques (e.g., Large Language Models, Multi\\-Modal, Large Vision Models) or with Generative AI\\-related concepts (e.g., language modeling, computer vision).\n\n  \n\n### **Preferred qualifications:**\n\n* Master’s degree or PhD in Engineering, Computer Science, or a related technical field.\n* 8 years of experience with data structures/algorithms.\n* 5 years of experience in a technical leadership role leading project teams and setting technical direction.\n* 3 years of experience working in a complex, matrixed organization involving cross\\-functional, or cross\\-business projects.\n\n**About the job**\n-----------------\n\n\nGoogle's software engineers develop the next\\-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large\\-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast\\-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full\\-stack as we continue to push technology forward.\n\n\n\nGoogle Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise\\-grade solutions that leverage Google’s cutting\\-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.\n\n\nThe US base salary range for this full\\-time position is $248,000\\-$349,000 \\+ bonus \\+ equity \\+ benefits. Our salary ranges are determined by role, level, and location. Within the range, individual pay is determined by work location and additional factors, including job\\-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.\n\n\nPlease note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google.\n**Responsibilities**\n--------------------\n\n* Lead the architectural design and implementation of the core backend services for the Agentic AI platform, built on a modern asynchronous, event\\-driven framework.\n* Build the agent API, the foundational layer that provides the design and execution environment for next\\-generation agents, abstracting away the complexities of Google Cloud Platform for users.\n* Develop the infrastructure for multi\\-agent orchestration and communication, enabling specialized agents to work together to achieve goals.\n* Create the core systems for always on analysis, allowing agents to ingest and reason over data from hundreds of disparate sources in real time, from ERPs and CRMs to unstructured documents and emails.\n* Implement foundational capabilities for agent tool use and reasoning, allowing agents to autonomously interact with APIs, databases, and other applications to accomplish their tasks while working on\\-site at Sunnyvale office five days per week.\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form.",
    'company_industry': None,
    'company_url': 'https://www.indeed.com/cmp/Google',
    'company_logo': 'https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/fff4be3829cee39e477a518f55475f44',
    'company_url_direct': 'http://goo.gle/3ygdkgv',
    'company_addresses': 'Mountain View, CA',
    'company_num_employees': '10,000+',
    'company_revenue': 'more than $10B (USD)',
    'company_description': 'Our mission is to organize the world’s information and make it universally accessible and useful. ',
    'skills': None,
    'experience_range': None,
    'company_rating': None,
    'company_reviews_count': None,
    'vacancy_count': None,
    'work_from_home_type': None
  }
]
